```
OpenTofu will perform the following actions:

  # github_actions_secret.gpo_ca_ssh_host_stage must be replaced
-/+ resource "github_actions_secret" "gpo_ca_ssh_host_stage" {
      ~ created_at      = "2024-08-26 20:24:52 +0000 UTC" -> (known after apply)
      ~ id              = "gpo.ca:SSH_HOST_STAGE" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-08-26 20:24:52 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.secure_gpo_ca_ssh_host_stage must be replaced
-/+ resource "github_actions_secret" "secure_gpo_ca_ssh_host_stage" {
      ~ created_at      = "2024-07-22 05:15:25 +0000 UTC" -> (known after apply)
      ~ id              = "secure.gpo.ca:SSH_HOST_STAGE" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-07-22 05:15:25 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```